/*
    https://academy.elice.io/courses/486/lectures/3420/materials/21/

    elice 주간 알고리즘 - 미스터 코딩왕



    엘리스는 요즘 만화 미스터 코딩왕에 푹 빠져있습니다. 이 만화는 20년 동안 방영한
    만화영화라 총 1,000,000회로 구성되어 있습니다.

    엘리스가 이 만화를 nn개 다운로드를 받았는데, 각각 파일마다 크기가 달라서 랜덤한 순서대로
    다운로드가 완료되어 회차와 상관없이 순서가 뒤죽박죽으로 만화가 배치되었습니다.

    엘리스는 회차 순으로 만화를 보는 것을 좋아합니다. 엘리스를 도와서 뒤죽박죽으로 되어있는
    미스터 코딩왕 만화를 정렬해봅시다.


    입력

    첫 번째 줄에는 다운 받은 만화의 개수 n(1≤n≤1,000,000)개가 주어집니다.
    두 번째 줄에는 nn개의 드라마의 각각의 회차가 띄어쓰기로 구분해서 주어집니다.
    이 때, 반드시 회차를 연속해서 보지 않을 수도 있으며, 같은 회차를 두번 이상
    다운로드 받지 않았다고 합니다.



    출력
    띄어쓰기로 구분해서 만화를 오름차순으로 정렬합니다.



    입력 예시

    4
    1 5 2 3


    출력 예시

    1 2 3 5


    입력 예시 2

    7
    3 4 7 2 100 9 20

    출력 예시 2

    2 3 4 7 9 20 100



    주의! 이 실습에서는 다음 내장함수를 사용할 수 없습니다.
    sort(), sorted(), enumerate(), map(), min(), max()


 */


#include <iostream>
#include <vector>
#include <algorithm>
#include <cmath>
#include <cassert>


#include "unique_ptr.hpp"


class Solution {

};


int main() {

    usingUniquePtr();


    return 0;
}
