

#include <iostream>

int main() {

    std::cout << "\"하루하루는 성실하게. 인생 전체는 되는대로.\" "
                 "- 이동진" << std::endl << std::endl;


    std::cout << "\"제가 정말로 열심히 살아야겠다 진지하게 집중해야겠다 "
                 "생각한 게 박사 때거든요. "
                 "박사할 때도 부지런하지 않았고 저는 진짜 한 가지만 생각했어요. "
                 "내 인생에 탈출구는 이거 하나 밖에 없다. "
                 "주변 이야기를 들어보니까 논문을 좋은 걸 쓰면 잘될 것 같다. "
                 "그 다음에 제 이름 밑에 스탠퍼드 이렇게 하나 "
                 "찍혀보는 게 소원이었어요. 그래서 그거 하나만 집중한거죠. "
                 "제 인생 모든 걸 털어부었는데 주말에는 놀았어요. "
                 "평생 그런 패턴 한 가지에 집중해서 그것만 하고 주말에는 쉬고 "
                 "그게 저의 유일한 시간관리 전략이었던 같은데, "
                 "요즘 분들이 사실은 불안감 때문에 여러 가지를 하려고 시도를 "
                 "많이 하시는 것 같아요. \" - 홍정모"
                 " https://youtu.be/te15EX0gZaw " << std::endl;


    return 0;
}



