//따배씨++ 3.7 이진수 Binary Numbers

#ifndef CLION_0911_CPP37_H
#define CLION_0911_CPP37_H

#include <iostream>

void execFunc() {

    /*

     10진수

     0
     1
     2
     3
     4
     5
     6
     7
     8
     9
     10 = 10^1 + 0
     11 = 10^1 + 1
     12
     13
     ...


     337 = 300 + 30 + 7 = 10^2 * 3 + 10^1 * 3 + 10^0 * 7


     */



    /*
     * 2진수
     *
     * 0
     * 1
     * 10 = 2^1 * 1 + 2^0 * 0 = 2
     * 11 = 2^1 * 1 + 2^0 * 1 = 3
     *
     *
     *          11
     *        +  1
     *       -------
     *         100
     */



    /*
     *  자릿수 7654 3210
     *  이진수 0101 1110
     *
     *  2^7*0 + 2^6*1 + 2^5*0 + 2^4*1 +
     *  2^3*1 + 2^2*1 + 2^1*1 + 2^0*0
     *
     *  = 128*0 + 64*1 + 32*0 + 16*1  +
     *    8*1   + 4*1  + 2*1  + 1*0
     *
     *  = 64 + 16 + 8 + 4 + 2
     *
     *  = 94
     *
     *
     */


    /*
     *  148(decimal to binary)
     *
     *  148 / 2 = 74    r0      (r = remainder)
     *  74  / 2 = 37    r0
     *  37  / 2 = 18    r1
     *  18  / 2 = 9     r0
     *  9   / 2 = 4     r1
     *  4   / 2 = 2     r0
     *  2   / 2 = 1     r0
     *  1   / 2 = 0     r1
     *
     *  1001 0100
     */


    /*
     *  이진수 두개 더하기
     *
     *  0110    (6 in decimal)
     *  0111    (7 in decimal)
     *
     *  ------------------------
     *
     *  1101    (13 in decimal)
     *
     *
     */


    /*
     *
     *      -5를 이진수로
     *
     *
     *      1)
     *      일단 5만 이진수로 변환
     *
     *      0000 0101
     *
     *
     *      2)
     *      보수 complement
     *
     *      1111 1010
     *
     *
     *      3)
     *      1을 하나 더하기
     *
     *      1111 1011   <= -5
     *
     *
     */


    /*
     *
     * 이진수로 표현된 음의 정수를 다시 십진수로
     *
     * 1001 1110
     *
     * 1) 먼저 보수를 취하자
     * 0110 0001
     *
     * 2) 1 더하기
     * 0110 0010    ->  98  -> -98
     *
     *
     *
     *
     *
     *
     * signed vs unsigned
     *
     *
     * 우선 unsigned integer라 생각하고 변환을 하면
     *
     * 1001 1110
     *
     * -> 2^7*1 + 2^4*1 + 2^3*1 + 2^2*1 + 2^1*1
     *
     *    =  128 + 16 + 8 + 4 + 2
     *
     * 반면 unsigned integer라 생각하고 변환을 하면
     * -98이 나온다.
     *
     *
     */




}

#endif //CLION_0911_CPP37_H
